{"The new tools of monetary policy": "Since the 1980s, interest rates around the world have trended downward, reflecting lower inflation, demographic and technological forces that have increased desired global saving relative to desired investment, and other factors. Although low inflation and interest rates have many benefits, the new environment poses challenges for central banks, who have traditionally relied on cuts to&hellip;", "Evaluating lower-for-longer policies: Temporary price-level targeting": "Despite a long and sustained recovery from the Great Recession, a number of factors—including an aging population, slow productivity growth, and subdued inflation—continue to exert downward pressure on U.S. interest rates. It seems likely that even when monetary policy is at a neutral setting, neither restraining nor stimulating the economy, interest rates will remain significantly&hellip;", "The housing bubble, the credit crunch, and the Great Recession: A reply to Paul Krugman": "Why was the Great Recession so deep? Certainly, the collapse of the housing bubble was the key precipitating event; falling house prices depressed consumer wealth and spending while leading to sharp reductions in residential construction. However, as I argue in a new paper and blog post, the most damaging aspect of the unwinding bubble was&hellip;", "Financial panic and credit disruptions in the 2007-09 crisis": "At the height of the financial crisis a decade ago, economists and policymakers underestimated the depth and severity of the recession that would follow. I argue in a paper released today by the Brookings Papers on Economic Activity (BPEA) that remedying this failure demands a more thorough inclusion of credit-market factors in models and forecasts&hellip;", "Temporary price-level targeting: An alternative framework for monetary policy": "Low nominal interest rates, low inflation, and slow economic growth pose challenges to central bankers. In particular, with estimates of the long-run equilibrium level of the real interest rate quite low, the next recession may occur at a time when the Fed has little room to cut short-term rates. As I have written previously and&hellip;", "When growth is not enough": "Here is the text of my prepared remarks (“When Growth Is Not Enough”) for the European Central Bank Forum on Central Banking at Sintra on “Investment and growth in advanced economies.” Read my full remarks here.", "Some reflections on Japanese monetary policy": "Over the years, I’ve done a lot thinking and writing about challenges faced by Japanese monetary policymakers in their attempts to combat deflation. In some of my earlier pieces I argued that, if the Bank of Japan (BOJ) showed more resolve, it could readily overcome these problems. But, in recent years, the Bank has shown&hellip;", "The zero lower bound on interest rates:  How should the Fed respond?": "In yesterday’s post, I discussed recent research, by Michael Kiley and John Roberts of the Federal Reserve Board, on the problems for monetary policy that arise from the fact that short-term interest rates can’t fall (much) below zero. [1] Using econometric models to simulate the performance of the U.S. economy, Kiley and Roberts (KR) find that,&hellip;", "How big a problem is the zero lower bound on interest rates?": "If inflation is too low or unemployment too high, the Fed normally responds by pushing down short-term interest rates to boost spending. However, the scope for rate cuts is  limited by the fact that interest rates cannot fall (much) below zero, as people always have the option of holding cash, which pays zero interest, rather&hellip;", "Why Dodd-Frank’s orderly liquidation authority should be preserved": "The collapse of the investment bank Lehman Brothers in September 2008 was perhaps the defining event of the financial crisis. Lehman’s bankruptcy, followed by the near-collapse (save for government intervention) of the insurance company AIG, greatly intensified the fear and panic in markets, bringing the financial system and the economy to the brink of the&hellip;", "Technical Signal Could Wilt Sprouts Farmers Market Stock": "The 80-day moving average has meant more downside for SFM in the past", "Utility Stock Overdue for Bear Notes": "There's optimism to be unwound in the options pits, too", "Drug Stock Upgraded Despite Coronavirus Threat": "Goldman Sachs added Eli Lilly to its \"Conviction Buy\" list", "FCAU Stock Destroyed Amid Temporary Plant Closures": "The automaker announced that it was temporarily stopping production at its Italian factories", "PepsiCo Stock Sinks on Heels of $3.85 Billion Buyout": "PepsiCo Inc's stocks are down after the company bought Rockstar Energy Beverage", "FDA Clearance Sends Soliton Stock Surging": "SOLY continues to teeter along its year-to-date breakeven price", "How Stocks Behave During During a Market Bounce": "A look at which stocks do best after a V-bottom", "Buy the Dip on This Gold Stock": "Mining stocks have pushed higher amid the global sell-off", "Drug Stock Puts Trendline Support to the Test": "GILD has amassed 19% year-to-date", "Struggling Southwest Airline Stock Sinks Deeper on CEO Pay Cut": "Southwest Airlines' CEO announced he's taking a 10% pay cut in response to the sector's \"severe recession\"", "Earnings Beat Boosts Dick's Sporting Goods Stock": "The retailer just posted a fourth-quarter earnings and revenue beat", "Japanese Pharma Stock Sinks Amid COVID-19 Treatment": "AIM Immunotech is developing a vaccine that was used to contain the SARS outbreak", "SFIX Stock Falls With Revenue Forecast, Coronavirus": "Several analysts have cut their price targets", "GrubHub Stock Brushes Off Bull Note": "Grubhub was raised to \"perform\" from \"underperform\"", "FB Stock Struggles After Privacy Breach Allegation": "The Australian privacy regulator just accused Facebook of sharing the personal details  over 300,000 users without their knowledge", "Costco Halts Free Samples Amid COVID-19 Outbreak": "Costco is taking extra precautions with its free samples to protect customers from the coronavirus outbreak.", "One Oil Stock Bucking the Broad Market Crash": "XOM, CVX, and COG options volume is ramped up today", "2 Cruise Stocks Getting Slammed on U.S. COVID-19 Warnings": "U.S. health officials are warning Americans to avoid cruise ships as the coronavirus outbreak worsens", "Amazon Stock Falls Despite New Business Ventures": "Amazon was hit again by a COVID-19 fear wave", "TWTR Stock Drops on Debunked Trump Video, $1 Billion Deal": "Twitter stocks dipped after it flagged one of Trump's retweets", "SPY Level to Watch Before March Expiration": "There's been an increase in put options buying on the SPX", "March Kicks Off With Wild Week on Wall Street": "Tech took home big wins early in the week", "Investor Shakeup Launches Big Lots Stock Higher": "Two investors announced an 11% stake in the company", "JPM Stock Stumbles on CEO Surgery Scare, Coronavirus Headwinds": "J.P. Morgan's CEO Jamie Dimon is currently in recovery after emergency heart surgery", "Gap Stock Hits 11-Year Low on CEO Appointment": "The leader of its Old Navy Unit, Sonia Syngal, will take over as CEO later this month", "Option Alpha’s New Auto-Trading Platform Updates": "<p>Important Note: This post will be the central hub for updates on the new platform. It&#8217;ll be updated as needed and as new milestones are hit and/or when feedback is requested. The newest updates will be added to the top of the post with older updates pushed lower for reference. We encourage you to bookmark [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/option-alphas-new-auto-trading-platform-updates-162692.html\">Option Alpha&#8217;s New Auto-Trading Platform Updates</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 170: The 5 Critical Factors for ANY Trading Strategy": "<p>Factor-based strategies and trading systems are all the rage these days. We&#8217;ve been promoting these for many years now but it seems that more and more investors are catching on. As a result, we wanted to cover the 5 critical factors that your trading strategy should have. To us, these serve as the foundational elements [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/factor-trading-strategy-181568.html\">OAP 170: The 5 Critical Factors for ANY Trading Strategy</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 169: Interview w/ Kevin Davitt – Former Market Maker & CBOE Senior Instructor": "<p>This week we&#8217;re very excited to share our exclusive interview with Kevin Davitt, a special guest with tons of experience not only as a former market maker, but as the Senior Instructor for The Options Institute at CBOE. As many long-time listener&#8217;s know, we are highly selective with people we choose to bring on as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/kevin-davitt-market-maker-cboe-179348.html\">OAP 169: Interview w/ Kevin Davitt &#8211; Former Market Maker &#038; CBOE Senior Instructor</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 168: The 27 Biggest Options Trading Fears": "<p>Did you know that fear has nothing to do with logical or cognitive reasoning? It&#8217;s actually a completely physical response that originates in our body. We fear to be wrong because that might mean we will be alone and people will leave us, which means that we won&#8217;t be part of a tribe or community, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/options-trading-fears-176896.html\">OAP 168: The 27 Biggest Options Trading Fears</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 167: Options Trading Profit Targets – When Should You Break The Rules?": "<p>Oh, profit targets. The double edge sword of confusion for many traders. Take profits too early and you feel like you left money on the table. Too late and you kick yourself because the trade could have moved against you. And because we&#8217;ve been getting so many questions on when and why we&#8217;ve let positions [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/options-trading-profit-targets-175881.html\">OAP 167: Options Trading Profit Targets &#8211; When Should You Break The Rules?</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 166: Understanding The Put Call Ratio The Right Way": "<p>When it comes to market signals and timing indicators, the Put Call Ratio is one that naturally jumps to the top of many lists. Because the indicator looks at volume in both put and call options, the logical conclusion is that we can interpret the ratio to signal us from an impending top or possible [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/understanding-put-call-option-175229.html\">OAP 166: Understanding The Put Call Ratio The Right Way</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 165: Trading Options? Here Are The 11 “Golden Rules” To Follow": "<p>Personally, I don&#8217;t like rules. Mostly because I value freedom and flexibility so when someone says that I have to follow the rules I naturally push back. Things that confine me or tell me what to do don&#8217;t fly well with me. But that only applies to things outside of trading and investing. In the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/trading-options-golden-rules-171557.html\">OAP 165: Trading Options? Here Are The 11 &#8220;Golden Rules&#8221; To Follow</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "TD Ameritrade Announces The End of Trading Commissions": "<p>Today October 1st, TD Ameritrade, makers of the thinkorswim platform, announced the end of trading commissions as we’ve always known them. Get ready to enter a new era of retail trading! As the preferred brokerage of Option Alpha, we wanted to give you a rundown of these changes, and give you some insight on what [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/td-ameritrade-announces-end-of-trading-commissions-171348.html\">TD Ameritrade Announces The End of Trading Commissions</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 164: The 2 Major Problems With Buying Options During Low IV Markets": "<p>Since we are option sellers and our edge comes from selling overpriced options out into maturity it&#8217;s natural to assume that if we want to sell options when IV is high that buying options during low IV markets is a way to make money in the other direction. We get it and understand the rationale [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/buying-options-during-low-iv-markets-171082.html\">OAP 164: The 2 Major Problems With Buying Options During Low IV Markets</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 163: The 5 Month “Grind” Following XLE Short Put Option Assignment": "<p>This was a long trade. Maybe not the longest trade we&#8217;ve been involved in, but certainly one of the top ones as this short put option assignment lasted over 5 months. For most options traders looking to make a quick buck, this trade stretches their patience and conviction far beyond a reasonable level. Still, I [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/short-put-option-assignment-2-170807.html\">OAP 163: The 5 Month &#8220;Grind&#8221; Following XLE Short Put Option Assignment</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "Delaying elective procedures at American hospitals has been ‘minimal’ so far as U.S. coronavirus cases rise": "Some hospitals in the U.S. are already canceling or postponing elective medical appointments and procedures as they prepare for the possibility of a surge in COVID-19 patients.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=C5GLhdnafEs:K46WbLtduQw:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=C5GLhdnafEs:K46WbLtduQw:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=C5GLhdnafEs:K46WbLtduQw:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=C5GLhdnafEs:K46WbLtduQw:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=C5GLhdnafEs:K46WbLtduQw:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=C5GLhdnafEs:K46WbLtduQw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/C5GLhdnafEs\" height=\"1\" width=\"1\" alt=\"\"/>", "Key Words: Most of you ‘will be infected’ — Merkel’s message to Germany could ‘cause panic,’ Czech PM warns": "Merkel, like President Trump, has faced criticism for her government’s response to the coronavirus epidemic.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=hgxenUlaC3Y:LUNX5sEF180:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=hgxenUlaC3Y:LUNX5sEF180:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=hgxenUlaC3Y:LUNX5sEF180:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=hgxenUlaC3Y:LUNX5sEF180:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=hgxenUlaC3Y:LUNX5sEF180:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=hgxenUlaC3Y:LUNX5sEF180:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/hgxenUlaC3Y\" height=\"1\" width=\"1\" alt=\"\"/>", "Walmart may cut store hours to combat coronavirus and says a Kentucky associate has tested positive": "A Walmart Inc. associate in Kentucky has tested positive for the COVID-19 virus, the company said Wednesday while announcing potential store-hour restrictions at 24-hour locations even though traffic is rising.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=6FjfPem4P_A:cBWTCNy-iE0:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=6FjfPem4P_A:cBWTCNy-iE0:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=6FjfPem4P_A:cBWTCNy-iE0:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=6FjfPem4P_A:cBWTCNy-iE0:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=6FjfPem4P_A:cBWTCNy-iE0:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=6FjfPem4P_A:cBWTCNy-iE0:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/6FjfPem4P_A\" height=\"1\" width=\"1\" alt=\"\"/>", "Market Snapshot: Here’s how hard global markets could be hammered by a pandemic, according to UBS": "The outbreak of COVID-19 has been declared a pandemic by the World Health Organization, and that likely means more turbulence for global equity benchmarks that have already seen some of the most volatile trade since the 2008 financial crisis.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=-A64Fdxx7Lc:Ds4ZYKy__IY:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=-A64Fdxx7Lc:Ds4ZYKy__IY:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=-A64Fdxx7Lc:Ds4ZYKy__IY:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=-A64Fdxx7Lc:Ds4ZYKy__IY:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=-A64Fdxx7Lc:Ds4ZYKy__IY:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=-A64Fdxx7Lc:Ds4ZYKy__IY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/-A64Fdxx7Lc\" height=\"1\" width=\"1\" alt=\"\"/>", "Amazon’s cashier-less technology heading to NYC airports but other retailers will pass, experts say": "Cibo Express Markets at two New York City airports will have Amazon’s grab-and-go technology, but experts say there are lots of reasons other retailers won’t install it in their stores.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=mne3Y6p_5H0:1Ws-xakpVAI:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=mne3Y6p_5H0:1Ws-xakpVAI:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=mne3Y6p_5H0:1Ws-xakpVAI:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=mne3Y6p_5H0:1Ws-xakpVAI:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=mne3Y6p_5H0:1Ws-xakpVAI:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=mne3Y6p_5H0:1Ws-xakpVAI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/mne3Y6p_5H0\" height=\"1\" width=\"1\" alt=\"\"/>", "Key Words: Warren Buffett on the ‘one-two punch’ market panic: It took me 89 years to experience something like this": "The Berkshire Hathaway boss put the recent market plunge into perspective in an interview this week on Yahoo Finance.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=FK4NiPvYXJc:nF__VB7dRdc:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=FK4NiPvYXJc:nF__VB7dRdc:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=FK4NiPvYXJc:nF__VB7dRdc:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=FK4NiPvYXJc:nF__VB7dRdc:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=FK4NiPvYXJc:nF__VB7dRdc:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=FK4NiPvYXJc:nF__VB7dRdc:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/FK4NiPvYXJc\" height=\"1\" width=\"1\" alt=\"\"/>", "Deciding whether to take a trip? Here’s what  it’s like flying in Europe right now as coronavirus rages": "I picked a hectic weekend to make a last minute dash for a wedding in London from my home in Madrid. Here’s what you need to know about flying right now.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=JI0enhGSsMM:5CPL1cEjLak:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=JI0enhGSsMM:5CPL1cEjLak:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=JI0enhGSsMM:5CPL1cEjLak:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=JI0enhGSsMM:5CPL1cEjLak:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=JI0enhGSsMM:5CPL1cEjLak:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=JI0enhGSsMM:5CPL1cEjLak:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/JI0enhGSsMM\" height=\"1\" width=\"1\" alt=\"\"/>", "Futures Movers: Oil prices drop as U.S. crude supplies rise a 7th straight week and Saudi Arabia moves to boost output": "Oil futures end lower Wednesday, pressured by U.S. government data reporting domestic crude supplies rose for a seventh week in a row, and by Saudi Arabia’s move to increase output capacity, as it intensifies a price war with Russia that sent crude prices tumbling to four-year lows this week.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=82sHd8iaYRU:CnXD2cT64OY:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=82sHd8iaYRU:CnXD2cT64OY:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=82sHd8iaYRU:CnXD2cT64OY:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=82sHd8iaYRU:CnXD2cT64OY:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=82sHd8iaYRU:CnXD2cT64OY:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=82sHd8iaYRU:CnXD2cT64OY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/82sHd8iaYRU\" height=\"1\" width=\"1\" alt=\"\"/>", "Key Words: These parents are still sending their college daughter on a booze cruise, because alcohol will ‘ward off’ germs and coronavirus": "‘I got her some Lysol wipes and the all you can drink package’<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=QytPuz4FqLg:f5qg0E-yhUM:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=QytPuz4FqLg:f5qg0E-yhUM:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=QytPuz4FqLg:f5qg0E-yhUM:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=QytPuz4FqLg:f5qg0E-yhUM:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=QytPuz4FqLg:f5qg0E-yhUM:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=QytPuz4FqLg:f5qg0E-yhUM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/QytPuz4FqLg\" height=\"1\" width=\"1\" alt=\"\"/>", "How the coronavirus spread is stressing out corporate credit as governments weigh economic stimulus": "Empty airline seats, cancelled hotel rooms, and missed social gatherings suddenly have become a part of normal life as U.S. families and companies look to avoid the spreading infectious disease known as COVID-19.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=xwNfjYSgerg:TpKQxaSq5is:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=xwNfjYSgerg:TpKQxaSq5is:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=xwNfjYSgerg:TpKQxaSq5is:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=xwNfjYSgerg:TpKQxaSq5is:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=xwNfjYSgerg:TpKQxaSq5is:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=xwNfjYSgerg:TpKQxaSq5is:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/xwNfjYSgerg\" height=\"1\" width=\"1\" alt=\"\"/>"}