{"The new tools of monetary policy": "Since the 1980s, interest rates around the world have trended downward, reflecting lower inflation, demographic and technological forces that have increased desired global saving relative to desired investment, and other factors. Although low inflation and interest rates have many benefits, the new environment poses challenges for central banks, who have traditionally relied on cuts to&hellip;", "Evaluating lower-for-longer policies: Temporary price-level targeting": "Despite a long and sustained recovery from the Great Recession, a number of factors—including an aging population, slow productivity growth, and subdued inflation—continue to exert downward pressure on U.S. interest rates. It seems likely that even when monetary policy is at a neutral setting, neither restraining nor stimulating the economy, interest rates will remain significantly&hellip;", "The housing bubble, the credit crunch, and the Great Recession: A reply to Paul Krugman": "Why was the Great Recession so deep? Certainly, the collapse of the housing bubble was the key precipitating event; falling house prices depressed consumer wealth and spending while leading to sharp reductions in residential construction. However, as I argue in a new paper and blog post, the most damaging aspect of the unwinding bubble was&hellip;", "Financial panic and credit disruptions in the 2007-09 crisis": "At the height of the financial crisis a decade ago, economists and policymakers underestimated the depth and severity of the recession that would follow. I argue in a paper released today by the Brookings Papers on Economic Activity (BPEA) that remedying this failure demands a more thorough inclusion of credit-market factors in models and forecasts&hellip;", "Temporary price-level targeting: An alternative framework for monetary policy": "Low nominal interest rates, low inflation, and slow economic growth pose challenges to central bankers. In particular, with estimates of the long-run equilibrium level of the real interest rate quite low, the next recession may occur at a time when the Fed has little room to cut short-term rates. As I have written previously and&hellip;", "When growth is not enough": "Here is the text of my prepared remarks (“When Growth Is Not Enough”) for the European Central Bank Forum on Central Banking at Sintra on “Investment and growth in advanced economies.” Read my full remarks here.", "Some reflections on Japanese monetary policy": "Over the years, I’ve done a lot thinking and writing about challenges faced by Japanese monetary policymakers in their attempts to combat deflation. In some of my earlier pieces I argued that, if the Bank of Japan (BOJ) showed more resolve, it could readily overcome these problems. But, in recent years, the Bank has shown&hellip;", "The zero lower bound on interest rates:  How should the Fed respond?": "In yesterday’s post, I discussed recent research, by Michael Kiley and John Roberts of the Federal Reserve Board, on the problems for monetary policy that arise from the fact that short-term interest rates can’t fall (much) below zero. [1] Using econometric models to simulate the performance of the U.S. economy, Kiley and Roberts (KR) find that,&hellip;", "How big a problem is the zero lower bound on interest rates?": "If inflation is too low or unemployment too high, the Fed normally responds by pushing down short-term interest rates to boost spending. However, the scope for rate cuts is  limited by the fact that interest rates cannot fall (much) below zero, as people always have the option of holding cash, which pays zero interest, rather&hellip;", "Why Dodd-Frank’s orderly liquidation authority should be preserved": "The collapse of the investment bank Lehman Brothers in September 2008 was perhaps the defining event of the financial crisis. Lehman’s bankruptcy, followed by the near-collapse (save for government intervention) of the insurance company AIG, greatly intensified the fear and panic in markets, bringing the financial system and the economy to the brink of the&hellip;", "American Eagle Stock Flies Lower Despite Earnings Beat": "AEO's 50-day moving average has kept a lid on any rallies since November", "Inflation Data, Earnings Stragglers on Deck": "Broadcom, Adobe, Gap, and Ulta will step into the earnings confessional", "C-Suite Pay Cuts Slam Virgin Galactic Stock": "Virgin Galactic's CEO will take a 20% pay cut, while the executive team's wages will be reduced by 15%", "Kroger Stock Picks Up Steam Ahead of Earnings": "Kroger is expected to reveal its fourth-quarter report before the open tomorrow", "CRON Stock Higher on Analyst Note": "MKM Partners is dismissing concerns over Cronos' delayed earnings report", "Chipotle Stock Breaks Out of Sell-Off Shell": "Wells Fargo upgraded Chipotle to \"overweight\" from \"equal weight\"", "UnitedHealth Stock Rallies After Biden's Big Win": "UNH has almost caught up to its year-to-date breakeven point now", "Dollar Tree Stock Chopped After Weak Forecast": "The retailer posted fourth-quarter revenue that missed the mark", "What Happens After the SPX Hits Correction Territory": "Past trends help us grapple with alarming pullbacks following all-time highs", "FTSV Stock Attracts Options Bulls, Analysts": "Taking a look at Wall Street's reaction to the M&A buzz surrounding Forty Seven", "Sell-Off Brings Historic Options Trading Volume": "Some traders might be betting on more downside in the coming weeks", "Tilray Stock Drop Stems From Steep Quarterly Loss": "A brutal quarterly report loss caused Tilray's stock to plunge further", "Penny Stock Pops On COVID-19 Vaccine Development": "INO is nearing its Jan. 27 annual high", "Target Stock Sinks on Weak Revenue, Outlook": "TGT is down 16.5% year-to-date", "$11.5 Billion Deal Boosts QGEN Stock": "Thermo Fisher just agreed to buy Qiagen in a $11.5 billion deal", "Options Players, Analysts Flock to JD Stock After Earnings": "Jefferies lifted its price target to $53.40 from $50", "Options Bulls Blast Volatile Moderna Stock": "Moderna is eyeing its highest close on record", "Airliner Puts Pop as COVID-19 Cases Rise": "Both AAL and DAL are tremendously oversold", "Analyst Sings Western Digital's Praises": "Stifel upgraded WDC to \"buy\" from \"hold\"", "Twitter Stock Rises Amid Possible C-Suite Shakeup": "TWTR is up 14% year-to-date", "Analyst Note Pushes Apple Stock Out of Sell-Off Slump": "Most analysts give Apple a positive outlook", "A Long-Term SPX Trendline to Watch": "Now may be the time to sell short-term QQQ put options", "Unpacking Wall Street's Worst Week Since the Financial Crisis": "The coronavirus outbreak is nearing pandemic status", "Wayfair Stock Falls to Three Year Low": "Wayfair stock is heading toward its sixth straight loss", "NVAX Stock Surges on COVID-19 Vaccine Development": "NVAX is still enjoying tailwinds after the vaccine announcement", "Option Alpha’s New Auto-Trading Platform Updates": "<p>Important Note: This post will be the central hub for updates on the new platform. It&#8217;ll be updated as needed and as new milestones are hit and/or when feedback is requested. The newest updates will be added to the top of the post with older updates pushed lower for reference. We encourage you to bookmark [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/option-alphas-new-auto-trading-platform-updates-162692.html\">Option Alpha&#8217;s New Auto-Trading Platform Updates</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 170: The 5 Critical Factors for ANY Trading Strategy": "<p>Factor-based strategies and trading systems are all the rage these days. We&#8217;ve been promoting these for many years now but it seems that more and more investors are catching on. As a result, we wanted to cover the 5 critical factors that your trading strategy should have. To us, these serve as the foundational elements [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/factor-trading-strategy-181568.html\">OAP 170: The 5 Critical Factors for ANY Trading Strategy</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 169: Interview w/ Kevin Davitt – Former Market Maker & CBOE Senior Instructor": "<p>This week we&#8217;re very excited to share our exclusive interview with Kevin Davitt, a special guest with tons of experience not only as a former market maker, but as the Senior Instructor for The Options Institute at CBOE. As many long-time listener&#8217;s know, we are highly selective with people we choose to bring on as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/kevin-davitt-market-maker-cboe-179348.html\">OAP 169: Interview w/ Kevin Davitt &#8211; Former Market Maker &#038; CBOE Senior Instructor</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 168: The 27 Biggest Options Trading Fears": "<p>Did you know that fear has nothing to do with logical or cognitive reasoning? It&#8217;s actually a completely physical response that originates in our body. We fear to be wrong because that might mean we will be alone and people will leave us, which means that we won&#8217;t be part of a tribe or community, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/options-trading-fears-176896.html\">OAP 168: The 27 Biggest Options Trading Fears</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 167: Options Trading Profit Targets – When Should You Break The Rules?": "<p>Oh, profit targets. The double edge sword of confusion for many traders. Take profits too early and you feel like you left money on the table. Too late and you kick yourself because the trade could have moved against you. And because we&#8217;ve been getting so many questions on when and why we&#8217;ve let positions [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/options-trading-profit-targets-175881.html\">OAP 167: Options Trading Profit Targets &#8211; When Should You Break The Rules?</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 166: Understanding The Put Call Ratio The Right Way": "<p>When it comes to market signals and timing indicators, the Put Call Ratio is one that naturally jumps to the top of many lists. Because the indicator looks at volume in both put and call options, the logical conclusion is that we can interpret the ratio to signal us from an impending top or possible [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/understanding-put-call-option-175229.html\">OAP 166: Understanding The Put Call Ratio The Right Way</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 165: Trading Options? Here Are The 11 “Golden Rules” To Follow": "<p>Personally, I don&#8217;t like rules. Mostly because I value freedom and flexibility so when someone says that I have to follow the rules I naturally push back. Things that confine me or tell me what to do don&#8217;t fly well with me. But that only applies to things outside of trading and investing. In the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/trading-options-golden-rules-171557.html\">OAP 165: Trading Options? Here Are The 11 &#8220;Golden Rules&#8221; To Follow</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "TD Ameritrade Announces The End of Trading Commissions": "<p>Today October 1st, TD Ameritrade, makers of the thinkorswim platform, announced the end of trading commissions as we’ve always known them. Get ready to enter a new era of retail trading! As the preferred brokerage of Option Alpha, we wanted to give you a rundown of these changes, and give you some insight on what [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/td-ameritrade-announces-end-of-trading-commissions-171348.html\">TD Ameritrade Announces The End of Trading Commissions</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 164: The 2 Major Problems With Buying Options During Low IV Markets": "<p>Since we are option sellers and our edge comes from selling overpriced options out into maturity it&#8217;s natural to assume that if we want to sell options when IV is high that buying options during low IV markets is a way to make money in the other direction. We get it and understand the rationale [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/buying-options-during-low-iv-markets-171082.html\">OAP 164: The 2 Major Problems With Buying Options During Low IV Markets</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 163: The 5 Month “Grind” Following XLE Short Put Option Assignment": "<p>This was a long trade. Maybe not the longest trade we&#8217;ve been involved in, but certainly one of the top ones as this short put option assignment lasted over 5 months. For most options traders looking to make a quick buck, this trade stretches their patience and conviction far beyond a reasonable level. Still, I [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/short-put-option-assignment-2-170807.html\">OAP 163: The 5 Month &#8220;Grind&#8221; Following XLE Short Put Option Assignment</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "The Ratings Game: Zoom Communications stock climbs as analysts cheer earnings and predict coronavirus boost": "Zoom Video Communications Inc.‘s shares reversed early losses to gain more than 9% Thursday, as analysts welcomed better-than-expected fourth-quarter earnings and forecast that the coronavirus will drive strong demand for the company’s remote-work tools.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=4FVEm0Va8Gk:1RYhuSlIztE:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=4FVEm0Va8Gk:1RYhuSlIztE:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=4FVEm0Va8Gk:1RYhuSlIztE:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=4FVEm0Va8Gk:1RYhuSlIztE:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=4FVEm0Va8Gk:1RYhuSlIztE:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=4FVEm0Va8Gk:1RYhuSlIztE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/4FVEm0Va8Gk\" height=\"1\" width=\"1\" alt=\"\"/>", "Coronavirus outbreak aside, China stocks just hit two-year highs": "Chinese stocks hit a two-year high Thursday, as new coronavirus cases fall inside the country and rise elsewhere around the world.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=FLi1m7wCp6c:XHAI1NqVRCY:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=FLi1m7wCp6c:XHAI1NqVRCY:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=FLi1m7wCp6c:XHAI1NqVRCY:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=FLi1m7wCp6c:XHAI1NqVRCY:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=FLi1m7wCp6c:XHAI1NqVRCY:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=FLi1m7wCp6c:XHAI1NqVRCY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/FLi1m7wCp6c\" height=\"1\" width=\"1\" alt=\"\"/>", "Brett Arends's ROI: SEC cracking down on ‘misleading’ mutual-fund names — says they can have a ‘significant impact’ on investment decisions": "‘Fund names are often the first piece of information investors see and they can have a significant impact on an investment decision,’ the SEC says.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=VwarCEkCZ-8:hvfTjG3PT8w:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=VwarCEkCZ-8:hvfTjG3PT8w:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=VwarCEkCZ-8:hvfTjG3PT8w:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=VwarCEkCZ-8:hvfTjG3PT8w:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=VwarCEkCZ-8:hvfTjG3PT8w:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=VwarCEkCZ-8:hvfTjG3PT8w:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/VwarCEkCZ-8\" height=\"1\" width=\"1\" alt=\"\"/>", "Capitol Report: Elizabeth Warren to end presidential bid, reports say": "Massachusetts Sen. Elizabeth Warren is ending her presidential campaign, according to reports Thursday, clearing a path for a two-way battle between Joe Biden and Bernie Sanders for the Democratic nomination.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=U64cPifj29A:vQD8sVORbwU:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=U64cPifj29A:vQD8sVORbwU:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=U64cPifj29A:vQD8sVORbwU:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=U64cPifj29A:vQD8sVORbwU:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=U64cPifj29A:vQD8sVORbwU:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=U64cPifj29A:vQD8sVORbwU:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/U64cPifj29A\" height=\"1\" width=\"1\" alt=\"\"/>", "Deep Dive: Here’s how easy it is to buy U.S. Treasury bonds without fees or commissions": "U.S. Treasury securities are among the world’s hottest investments.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=ytF3vZaV4Co:IbXRBANfoQU:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=ytF3vZaV4Co:IbXRBANfoQU:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=ytF3vZaV4Co:IbXRBANfoQU:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=ytF3vZaV4Co:IbXRBANfoQU:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=ytF3vZaV4Co:IbXRBANfoQU:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=ytF3vZaV4Co:IbXRBANfoQU:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/ytF3vZaV4Co\" height=\"1\" width=\"1\" alt=\"\"/>", "Mortgage rates fall to all-time low amid coronavirus concerns — here’s why Americans may not take advantage of them": "The drop in mortgage rates isn’t likely to spur more people to put their homes up for sale.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=2QIYIYytw8Q:0rIxOooJzRQ:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=2QIYIYytw8Q:0rIxOooJzRQ:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=2QIYIYytw8Q:0rIxOooJzRQ:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=2QIYIYytw8Q:0rIxOooJzRQ:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=2QIYIYytw8Q:0rIxOooJzRQ:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=2QIYIYytw8Q:0rIxOooJzRQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/2QIYIYytw8Q\" height=\"1\" width=\"1\" alt=\"\"/>", "Futures Movers: Oil falls as OPEC recommends further output cuts, but doubts over Russia’s cooperation weigh": "Oil futures fall on Thursday as the Organization of the Petroleum Exporting Countries recommended that its members, along with allied producers, cut production by an additional 1.5 million barrels a day, but the market expressed doubts over cooperation from non-member Russia.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=4gOS4HbK9ns:JIlafWHmNdM:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=4gOS4HbK9ns:JIlafWHmNdM:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=4gOS4HbK9ns:JIlafWHmNdM:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=4gOS4HbK9ns:JIlafWHmNdM:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=4gOS4HbK9ns:JIlafWHmNdM:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=4gOS4HbK9ns:JIlafWHmNdM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/4gOS4HbK9ns\" height=\"1\" width=\"1\" alt=\"\"/>", "Brett Arends's ROI: Scams are taking a heavy emotional toll on senior citizens": "It may be even worse than the financial cost, a new survey says<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=6KoUBDigJUs:Vh_i4IvEdIw:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=6KoUBDigJUs:Vh_i4IvEdIw:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=6KoUBDigJUs:Vh_i4IvEdIw:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=6KoUBDigJUs:Vh_i4IvEdIw:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=6KoUBDigJUs:Vh_i4IvEdIw:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=6KoUBDigJUs:Vh_i4IvEdIw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/6KoUBDigJUs\" height=\"1\" width=\"1\" alt=\"\"/>", "Capitol Report: Biden’s fundraising was improving before his Super Tuesday wins — and now Bloomberg’s money looks set to pour in": "With Mike Bloomberg exiting the Democratic presidential race and endorsing Joe Biden, a key question now is how much of the big-spending billionaire’s money will go toward helping his former rival’s campaign.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=XB9dCbTbStI:-UHlHz0T8Dk:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=XB9dCbTbStI:-UHlHz0T8Dk:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=XB9dCbTbStI:-UHlHz0T8Dk:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=XB9dCbTbStI:-UHlHz0T8Dk:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=XB9dCbTbStI:-UHlHz0T8Dk:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=XB9dCbTbStI:-UHlHz0T8Dk:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/XB9dCbTbStI\" height=\"1\" width=\"1\" alt=\"\"/>", "The coronavirus may force many Americans to work from home — but only a fraction can actually do that": "Older workers and those with families were usually happy to work from home, but it was a tougher experience for young and single workers, research suggests.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=N8O6Jv4xzW8:pbNXoXcNFB4:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=N8O6Jv4xzW8:pbNXoXcNFB4:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=N8O6Jv4xzW8:pbNXoXcNFB4:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=N8O6Jv4xzW8:pbNXoXcNFB4:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=N8O6Jv4xzW8:pbNXoXcNFB4:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=N8O6Jv4xzW8:pbNXoXcNFB4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/N8O6Jv4xzW8\" height=\"1\" width=\"1\" alt=\"\"/>"}