{
	"The new tools of monetary policy": "Since the 1980s, interest rates around the world have trended downward, reflecting lower inflation, demographic and technological forces that have increased desired global saving relative to desired investment, and other factors. Although low inflation and interest rates have many benefits, the new environment poses challenges for central banks, who have traditionally relied on cuts to&hellip;",
	"Evaluating lower-for-longer policies: Temporary price-level targeting": "Despite a long and sustained recovery from the Great Recession, a number of factors—including an aging population, slow productivity growth, and subdued inflation—continue to exert downward pressure on U.S. interest rates. It seems likely that even when monetary policy is at a neutral setting, neither restraining nor stimulating the economy, interest rates will remain significantly&hellip;",
	"The housing bubble, the credit crunch, and the Great Recession: A reply to Paul Krugman": "Why was the Great Recession so deep? Certainly, the collapse of the housing bubble was the key precipitating event; falling house prices depressed consumer wealth and spending while leading to sharp reductions in residential construction. However, as I argue in a new paper and blog post, the most damaging aspect of the unwinding bubble was&hellip;",
	"Financial panic and credit disruptions in the 2007-09 crisis": "At the height of the financial crisis a decade ago, economists and policymakers underestimated the depth and severity of the recession that would follow. I argue in a paper released today by the Brookings Papers on Economic Activity (BPEA) that remedying this failure demands a more thorough inclusion of credit-market factors in models and forecasts&hellip;",
	"Temporary price-level targeting: An alternative framework for monetary policy": "Low nominal interest rates, low inflation, and slow economic growth pose challenges to central bankers. In particular, with estimates of the long-run equilibrium level of the real interest rate quite low, the next recession may occur at a time when the Fed has little room to cut short-term rates. As I have written previously and&hellip;",
	"When growth is not enough": "Here is the text of my prepared remarks (“When Growth Is Not Enough”) for the European Central Bank Forum on Central Banking at Sintra on “Investment and growth in advanced economies.” Read my full remarks here.",
	"Some reflections on Japanese monetary policy": "Over the years, I’ve done a lot thinking and writing about challenges faced by Japanese monetary policymakers in their attempts to combat deflation. In some of my earlier pieces I argued that, if the Bank of Japan (BOJ) showed more resolve, it could readily overcome these problems. But, in recent years, the Bank has shown&hellip;",
	"The zero lower bound on interest rates:  How should the Fed respond?": "In yesterday’s post, I discussed recent research, by Michael Kiley and John Roberts of the Federal Reserve Board, on the problems for monetary policy that arise from the fact that short-term interest rates can’t fall (much) below zero. [1] Using econometric models to simulate the performance of the U.S. economy, Kiley and Roberts (KR) find that,&hellip;",
	"How big a problem is the zero lower bound on interest rates?": "If inflation is too low or unemployment too high, the Fed normally responds by pushing down short-term interest rates to boost spending. However, the scope for rate cuts is  limited by the fact that interest rates cannot fall (much) below zero, as people always have the option of holding cash, which pays zero interest, rather&hellip;",
	"Why Dodd-Frank’s orderly liquidation authority should be preserved": "The collapse of the investment bank Lehman Brothers in September 2008 was perhaps the defining event of the financial crisis. Lehman’s bankruptcy, followed by the near-collapse (save for government intervention) of the insurance company AIG, greatly intensified the fear and panic in markets, bringing the financial system and the economy to the brink of the&hellip;",
	"Amazon Stock Falls Despite New Business Ventures": "Amazon was hit again by a COVID-19 fear wave",
	"TWTR Stock Drops on Debunked Trump Video, $1 Billion Deal": "Twitter stocks dipped after it flagged one of Trump's retweets",
	"SPY Level to Watch Before March Expiration": "There's been an increase in put options buying on the SPX",
	"March Kicks Off With Wild Week on Wall Street": "Tech took home big wins early in the week",
	"Investor Shakeup Launches Big Lots Stock Higher": "Two investors announced an 11% stake in the company",
	"JPM Stock Stumbles on CEO Surgery Scare, Coronavirus Headwinds": "J.P. Morgan's CEO Jamie Dimon is currently in recovery after emergency heart surgery",
	"Gap Stock Hits 11-Year Low on CEO Appointment": "The leader of its Old Navy Unit, Sonia Syngal, will take over as CEO later this month",
	"This Real Estate Stock Could See Some Serious Upside": "Z is outperforming the broadmarket",
	"Options Bulls Bet on More Upside for TDOC Stock": "Options traders are picking up TDOC calls at an elevated clip today",
	"Burlington Stock Bounces After Earnings Beat": "The retailer's fourth-quarter earnings exceeded analysts' expectations",
	"American Eagle Stock Flies Lower Despite Earnings Beat": "AEO's 50-day moving average has kept a lid on any rallies since November",
	"Inflation Data, Earnings Stragglers on Deck": "Broadcom, Adobe, Gap, and Ulta will step into the earnings confessional",
	"Kroger Stock Picks Up Steam Ahead of Earnings": "Kroger is expected to reveal its fourth-quarter report before the open tomorrow",
	"CRON Stock Higher on Analyst Note": "MKM Partners is dismissing concerns over Cronos' delayed earnings report",
	"Chipotle Stock Breaks Out of Sell-Off Shell": "Wells Fargo upgraded Chipotle to \"overweight\" from \"equal weight\"",
	"UnitedHealth Stock Rallies After Biden's Big Win": "UNH has almost caught up to its year-to-date breakeven point now",
	"Dollar Tree Stock Chopped After Weak Forecast": "The retailer posted fourth-quarter revenue that missed the mark",
	"What Happens After the SPX Hits Correction Territory": "Past trends help us grapple with alarming pullbacks following all-time highs",
	"FTSV Stock Attracts Options Bulls, Analysts": "Taking a look at Wall Street's reaction to the M&A buzz surrounding Forty Seven",
	"Sell-Off Brings Historic Options Trading Volume": "Some traders might be betting on more downside in the coming weeks",
	"Tilray Stock Drop Stems From Steep Quarterly Loss": "A brutal quarterly report loss caused Tilray's stock to plunge further",
	"Penny Stock Pops On COVID-19 Vaccine Development": "INO is nearing its Jan. 27 annual high",
	"Target Stock Sinks on Weak Revenue, Outlook": "TGT is down 16.5% year-to-date",
	"$11.5 Billion Deal Boosts QGEN Stock": "Thermo Fisher just agreed to buy Qiagen in a $11.5 billion deal",
	"Options Players, Analysts Flock to JD Stock After Earnings": "Jefferies lifted its price target to $53.40 from $50",
	"Option Alpha’s New Auto-Trading Platform Updates": "<p>Important Note: This post will be the central hub for updates on the new platform. It&#8217;ll be updated as needed and as new milestones are hit and/or when feedback is requested. The newest updates will be added to the top of the post with older updates pushed lower for reference. We encourage you to bookmark [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/option-alphas-new-auto-trading-platform-updates-162692.html\">Option Alpha&#8217;s New Auto-Trading Platform Updates</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>",
	"OAP 170: The 5 Critical Factors for ANY Trading Strategy": "<p>Factor-based strategies and trading systems are all the rage these days. We&#8217;ve been promoting these for many years now but it seems that more and more investors are catching on. As a result, we wanted to cover the 5 critical factors that your trading strategy should have. To us, these serve as the foundational elements [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/factor-trading-strategy-181568.html\">OAP 170: The 5 Critical Factors for ANY Trading Strategy</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>",
	"OAP 169: Interview w/ Kevin Davitt – Former Market Maker & CBOE Senior Instructor": "<p>This week we&#8217;re very excited to share our exclusive interview with Kevin Davitt, a special guest with tons of experience not only as a former market maker, but as the Senior Instructor for The Options Institute at CBOE. As many long-time listener&#8217;s know, we are highly selective with people we choose to bring on as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/kevin-davitt-market-maker-cboe-179348.html\">OAP 169: Interview w/ Kevin Davitt &#8211; Former Market Maker &#038; CBOE Senior Instructor</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>",
	"OAP 168: The 27 Biggest Options Trading Fears": "<p>Did you know that fear has nothing to do with logical or cognitive reasoning? It&#8217;s actually a completely physical response that originates in our body. We fear to be wrong because that might mean we will be alone and people will leave us, which means that we won&#8217;t be part of a tribe or community, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/options-trading-fears-176896.html\">OAP 168: The 27 Biggest Options Trading Fears</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>",
	"OAP 167: Options Trading Profit Targets – When Should You Break The Rules?": "<p>Oh, profit targets. The double edge sword of confusion for many traders. Take profits too early and you feel like you left money on the table. Too late and you kick yourself because the trade could have moved against you. And because we&#8217;ve been getting so many questions on when and why we&#8217;ve let positions [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/options-trading-profit-targets-175881.html\">OAP 167: Options Trading Profit Targets &#8211; When Should You Break The Rules?</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>",
	"OAP 166: Understanding The Put Call Ratio The Right Way": "<p>When it comes to market signals and timing indicators, the Put Call Ratio is one that naturally jumps to the top of many lists. Because the indicator looks at volume in both put and call options, the logical conclusion is that we can interpret the ratio to signal us from an impending top or possible [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/understanding-put-call-option-175229.html\">OAP 166: Understanding The Put Call Ratio The Right Way</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>",
	"OAP 165: Trading Options? Here Are The 11 “Golden Rules” To Follow": "<p>Personally, I don&#8217;t like rules. Mostly because I value freedom and flexibility so when someone says that I have to follow the rules I naturally push back. Things that confine me or tell me what to do don&#8217;t fly well with me. But that only applies to things outside of trading and investing. In the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/trading-options-golden-rules-171557.html\">OAP 165: Trading Options? Here Are The 11 &#8220;Golden Rules&#8221; To Follow</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>",
	"TD Ameritrade Announces The End of Trading Commissions": "<p>Today October 1st, TD Ameritrade, makers of the thinkorswim platform, announced the end of trading commissions as we’ve always known them. Get ready to enter a new era of retail trading! As the preferred brokerage of Option Alpha, we wanted to give you a rundown of these changes, and give you some insight on what [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/td-ameritrade-announces-end-of-trading-commissions-171348.html\">TD Ameritrade Announces The End of Trading Commissions</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>",
	"OAP 164: The 2 Major Problems With Buying Options During Low IV Markets": "<p>Since we are option sellers and our edge comes from selling overpriced options out into maturity it&#8217;s natural to assume that if we want to sell options when IV is high that buying options during low IV markets is a way to make money in the other direction. We get it and understand the rationale [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/buying-options-during-low-iv-markets-171082.html\">OAP 164: The 2 Major Problems With Buying Options During Low IV Markets</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>",
	"OAP 163: The 5 Month “Grind” Following XLE Short Put Option Assignment": "<p>This was a long trade. Maybe not the longest trade we&#8217;ve been involved in, but certainly one of the top ones as this short put option assignment lasted over 5 months. For most options traders looking to make a quick buck, this trade stretches their patience and conviction far beyond a reasonable level. Still, I [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/short-put-option-assignment-2-170807.html\">OAP 163: The 5 Month &#8220;Grind&#8221; Following XLE Short Put Option Assignment</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>",
	"Election: Sanders attacks Biden on trade as Democrats’ battle moves to Michigan and beyond": "Bernie Sanders is attacking Joe Biden on trade policy as the two Democratic presidential hopefuls face the next round of primaries on Tuesday, with Michigan the big delegate prize of the day.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=dzzFeT9qGww:nBs6SU4JjkI:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=dzzFeT9qGww:nBs6SU4JjkI:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=dzzFeT9qGww:nBs6SU4JjkI:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=dzzFeT9qGww:nBs6SU4JjkI:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=dzzFeT9qGww:nBs6SU4JjkI:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=dzzFeT9qGww:nBs6SU4JjkI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/dzzFeT9qGww\" height=\"1\" width=\"1\" alt=\"\"/>",
	"Peter Morici: Trump will ride the center lane in fall election campaign": "Donald Trump will defend the status quo in November against a Democrat who offers a radical vision of America.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=yDzk8HgIkwY:NShqF9yPxyk:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=yDzk8HgIkwY:NShqF9yPxyk:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=yDzk8HgIkwY:NShqF9yPxyk:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=yDzk8HgIkwY:NShqF9yPxyk:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=yDzk8HgIkwY:NShqF9yPxyk:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=yDzk8HgIkwY:NShqF9yPxyk:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/yDzk8HgIkwY\" height=\"1\" width=\"1\" alt=\"\"/>",
	"Brett Arends's ROI: Markets plunge Monday on fears of OPEC ‘price war’ — 5 key questions you should ask your financial adviser right now": "Advisers say this is a ‘great litmus test’ to evaluate your risk tolerance, but they say retail investors should proceed cautiously.’<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=spJosg6j-Vs:B6gjtIrBB6c:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=spJosg6j-Vs:B6gjtIrBB6c:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=spJosg6j-Vs:B6gjtIrBB6c:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=spJosg6j-Vs:B6gjtIrBB6c:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=spJosg6j-Vs:B6gjtIrBB6c:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=spJosg6j-Vs:B6gjtIrBB6c:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/spJosg6j-Vs\" height=\"1\" width=\"1\" alt=\"\"/>",
	"United, Delta and seven other airlines are waiving flight change fees because of the coronavirus outbreak": "Some airlines waiving fees for all flights, while others are focusing on flights to regions heavily impacted by the outbreak.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Uykz0IGGkAM:Qvi8CdO7MHs:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Uykz0IGGkAM:Qvi8CdO7MHs:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=Uykz0IGGkAM:Qvi8CdO7MHs:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Uykz0IGGkAM:Qvi8CdO7MHs:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=Uykz0IGGkAM:Qvi8CdO7MHs:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Uykz0IGGkAM:Qvi8CdO7MHs:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/Uykz0IGGkAM\" height=\"1\" width=\"1\" alt=\"\"/>",
	"The Tell: OPEC price war one of three worst things that could hit virus-wracked markets, JPMorgan strategist says": "The OPEC+ price war was one of the three worst things that could hit virus-strained markets. Here are the top places to seek refuge.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Ydvr81oGkmQ:WclXe_EA1D4:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Ydvr81oGkmQ:WclXe_EA1D4:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=Ydvr81oGkmQ:WclXe_EA1D4:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Ydvr81oGkmQ:WclXe_EA1D4:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=Ydvr81oGkmQ:WclXe_EA1D4:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Ydvr81oGkmQ:WclXe_EA1D4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/Ydvr81oGkmQ\" height=\"1\" width=\"1\" alt=\"\"/>",
	"Market Snapshot: Dow plunges 7.2% and S&P 500’s plunge triggers 15 minute halt at lows as oil prices deliver a punishing blow to Wall Street": "U.S. stock indexes on Monday morning tumble, triggering a circuit breaker as fears of an oil price war between OPEC and Russia sent crude futures plunging, sending shock waves through global financial markets already shaken by the spread of COVID-19<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=pqSGeitrGf4:2LZvHi2_xV8:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=pqSGeitrGf4:2LZvHi2_xV8:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=pqSGeitrGf4:2LZvHi2_xV8:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=pqSGeitrGf4:2LZvHi2_xV8:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=pqSGeitrGf4:2LZvHi2_xV8:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=pqSGeitrGf4:2LZvHi2_xV8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/pqSGeitrGf4\" height=\"1\" width=\"1\" alt=\"\"/>",
	"As coronavirus spreads, Frontier Airlines passengers cry foul over cancellation fees — the airline calls it a ‘communications disconnect’": "Passengers were told they would have to pay change fees after the airline said it was waiving the charges.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=dHYjuDg1HwA:al5gvd__5oM:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=dHYjuDg1HwA:al5gvd__5oM:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=dHYjuDg1HwA:al5gvd__5oM:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=dHYjuDg1HwA:al5gvd__5oM:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=dHYjuDg1HwA:al5gvd__5oM:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=dHYjuDg1HwA:al5gvd__5oM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/dHYjuDg1HwA\" height=\"1\" width=\"1\" alt=\"\"/>",
	"In stunning reversal, IEA now sees oil demand falling this year": "The International Energy Agency on Monday issued a stunning forecast, now projecting oil demand to fall this year on the same day prices collapsed by some 20%.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=IQ6khaw91Q0:5KcyokaZePY:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=IQ6khaw91Q0:5KcyokaZePY:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=IQ6khaw91Q0:5KcyokaZePY:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=IQ6khaw91Q0:5KcyokaZePY:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=IQ6khaw91Q0:5KcyokaZePY:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=IQ6khaw91Q0:5KcyokaZePY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/IQ6khaw91Q0\" height=\"1\" width=\"1\" alt=\"\"/>",
	"Key Words: Why oil just topped the coronavirus as the stock market’s biggest problem": "Vital Knowledge founder Adam Crisafulli says dropping oil prices are becoming a real issue.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Gk4C8Hw8R9M:8k788WjFpXQ:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Gk4C8Hw8R9M:8k788WjFpXQ:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=Gk4C8Hw8R9M:8k788WjFpXQ:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Gk4C8Hw8R9M:8k788WjFpXQ:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=Gk4C8Hw8R9M:8k788WjFpXQ:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Gk4C8Hw8R9M:8k788WjFpXQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/Gk4C8Hw8R9M\" height=\"1\" width=\"1\" alt=\"\"/>",
	"The Wall Street Journal: Wells Fargo chairman Elizabeth Duke resigns after fake-account scam fallout": "Elizabeth Duke has resigned as chairman of Wells Fargo & Co.’s board of directors, days before she was set to testify at a congressional hearing on the continuing fallout from the bank’s 2016 fake-account scandal.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Rvr45MqKl-I:ksoVuFPy4lY:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Rvr45MqKl-I:ksoVuFPy4lY:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=Rvr45MqKl-I:ksoVuFPy4lY:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Rvr45MqKl-I:ksoVuFPy4lY:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=Rvr45MqKl-I:ksoVuFPy4lY:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Rvr45MqKl-I:ksoVuFPy4lY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/Rvr45MqKl-I\" height=\"1\" width=\"1\" alt=\"\"/>"
}
