{"The new tools of monetary policy": "Since the 1980s, interest rates around the world have trended downward, reflecting lower inflation, demographic and technological forces that have increased desired global saving relative to desired investment, and other factors. Although low inflation and interest rates have many benefits, the new environment poses challenges for central banks, who have traditionally relied on cuts to&hellip;", "Evaluating lower-for-longer policies: Temporary price-level targeting": "Despite a long and sustained recovery from the Great Recession, a number of factors—including an aging population, slow productivity growth, and subdued inflation—continue to exert downward pressure on U.S. interest rates. It seems likely that even when monetary policy is at a neutral setting, neither restraining nor stimulating the economy, interest rates will remain significantly&hellip;", "The housing bubble, the credit crunch, and the Great Recession: A reply to Paul Krugman": "Why was the Great Recession so deep? Certainly, the collapse of the housing bubble was the key precipitating event; falling house prices depressed consumer wealth and spending while leading to sharp reductions in residential construction. However, as I argue in a new paper and blog post, the most damaging aspect of the unwinding bubble was&hellip;", "Financial panic and credit disruptions in the 2007-09 crisis": "At the height of the financial crisis a decade ago, economists and policymakers underestimated the depth and severity of the recession that would follow. I argue in a paper released today by the Brookings Papers on Economic Activity (BPEA) that remedying this failure demands a more thorough inclusion of credit-market factors in models and forecasts&hellip;", "Temporary price-level targeting: An alternative framework for monetary policy": "Low nominal interest rates, low inflation, and slow economic growth pose challenges to central bankers. In particular, with estimates of the long-run equilibrium level of the real interest rate quite low, the next recession may occur at a time when the Fed has little room to cut short-term rates. As I have written previously and&hellip;", "When growth is not enough": "Here is the text of my prepared remarks (“When Growth Is Not Enough”) for the European Central Bank Forum on Central Banking at Sintra on “Investment and growth in advanced economies.” Read my full remarks here.", "Some reflections on Japanese monetary policy": "Over the years, I’ve done a lot thinking and writing about challenges faced by Japanese monetary policymakers in their attempts to combat deflation. In some of my earlier pieces I argued that, if the Bank of Japan (BOJ) showed more resolve, it could readily overcome these problems. But, in recent years, the Bank has shown&hellip;", "The zero lower bound on interest rates:  How should the Fed respond?": "In yesterday’s post, I discussed recent research, by Michael Kiley and John Roberts of the Federal Reserve Board, on the problems for monetary policy that arise from the fact that short-term interest rates can’t fall (much) below zero. [1] Using econometric models to simulate the performance of the U.S. economy, Kiley and Roberts (KR) find that,&hellip;", "How big a problem is the zero lower bound on interest rates?": "If inflation is too low or unemployment too high, the Fed normally responds by pushing down short-term interest rates to boost spending. However, the scope for rate cuts is  limited by the fact that interest rates cannot fall (much) below zero, as people always have the option of holding cash, which pays zero interest, rather&hellip;", "Why Dodd-Frank’s orderly liquidation authority should be preserved": "The collapse of the investment bank Lehman Brothers in September 2008 was perhaps the defining event of the financial crisis. Lehman’s bankruptcy, followed by the near-collapse (save for government intervention) of the insurance company AIG, greatly intensified the fear and panic in markets, bringing the financial system and the economy to the brink of the&hellip;", "BBY Stock Slammed After Executive Chairman Steps Down": "Former company CEO Hubert Joly announced his resignation as Executive Chairman today", "All Eyes on Fed Meeting Next Week as Coronavirus Grips U.S.": "FedEx, General Mills, and Lennar all step into the earnings confessional", "Sentiment Turns Sour Ahead of ULTA Earnings": "Ulta Beauty will post its fourth-quarter earnings after the close tonight", "Apple Supplier Ready to Step into Earnings Confessional": "Broadcom is expected to reveal its fourth-quarter report after the close tonight", "CME Closes Floor on Safety Concerns but Loses Ground": "CME Group closed its Chicago trading floor due to concerns over the spread of the coronavirus", "Boeing Stock Tanks on Billion-Dollar Loan Buzz": "Boeing stock is plummeting on its first downgrade from JPM in years", "Party City Stock Deflates After Earnings": "The retailer's fourth-quarter earnings and revenue reports fell well below analysts' expectation", "Technical Signal Could Wilt Sprouts Farmers Market Stock": "The 80-day moving average has meant more downside for SFM in the past", "Utility Stock Overdue for Bear Notes": "There's optimism to be unwound in the options pits, too", "Drug Stock Upgraded Despite Coronavirus Threat": "Goldman Sachs added Eli Lilly to its \"Conviction Buy\" list", "FCAU Stock Destroyed Amid Temporary Plant Closures": "The automaker announced that it was temporarily stopping production at its Italian factories", "PepsiCo Stock Sinks on Heels of $3.85 Billion Buyout": "PepsiCo Inc's stocks are down after the company bought Rockstar Energy Beverage", "FDA Clearance Sends Soliton Stock Surging": "SOLY continues to teeter along its year-to-date breakeven price", "How Stocks Behave During During a Market Bounce": "A look at which stocks do best after a V-bottom", "Buy the Dip on This Gold Stock": "Mining stocks have pushed higher amid the global sell-off", "Drug Stock Puts Trendline Support to the Test": "GILD has amassed 19% year-to-date", "Struggling Southwest Airline Stock Sinks Deeper on CEO Pay Cut": "Southwest Airlines' CEO announced he's taking a 10% pay cut in response to the sector's \"severe recession\"", "Earnings Beat Boosts Dick's Sporting Goods Stock": "The retailer just posted a fourth-quarter earnings and revenue beat", "Japanese Pharma Stock Sinks Amid COVID-19 Treatment": "AIM Immunotech is developing a vaccine that was used to contain the SARS outbreak", "SFIX Stock Falls With Revenue Forecast, Coronavirus": "Several analysts have cut their price targets", "GrubHub Stock Brushes Off Bull Note": "Grubhub was raised to \"perform\" from \"underperform\"", "FB Stock Struggles After Privacy Breach Allegation": "The Australian privacy regulator just accused Facebook of sharing the personal details  over 300,000 users without their knowledge", "Costco Halts Free Samples Amid COVID-19 Outbreak": "Costco is taking extra precautions with its free samples to protect customers from the coronavirus outbreak.", "One Oil Stock Bucking the Broad Market Crash": "XOM, CVX, and COG options volume is ramped up today", "2 Cruise Stocks Getting Slammed on U.S. COVID-19 Warnings": "U.S. health officials are warning Americans to avoid cruise ships as the coronavirus outbreak worsens", "Option Alpha’s New Auto-Trading Platform Updates": "<p>Important Note: This post will be the central hub for updates on the new platform. It&#8217;ll be updated as needed and as new milestones are hit and/or when feedback is requested. The newest updates will be added to the top of the post with older updates pushed lower for reference. We encourage you to bookmark [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/option-alphas-new-auto-trading-platform-updates-162692.html\">Option Alpha&#8217;s New Auto-Trading Platform Updates</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 170: The 5 Critical Factors for ANY Trading Strategy": "<p>Factor-based strategies and trading systems are all the rage these days. We&#8217;ve been promoting these for many years now but it seems that more and more investors are catching on. As a result, we wanted to cover the 5 critical factors that your trading strategy should have. To us, these serve as the foundational elements [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/factor-trading-strategy-181568.html\">OAP 170: The 5 Critical Factors for ANY Trading Strategy</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 169: Interview w/ Kevin Davitt – Former Market Maker & CBOE Senior Instructor": "<p>This week we&#8217;re very excited to share our exclusive interview with Kevin Davitt, a special guest with tons of experience not only as a former market maker, but as the Senior Instructor for The Options Institute at CBOE. As many long-time listener&#8217;s know, we are highly selective with people we choose to bring on as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/kevin-davitt-market-maker-cboe-179348.html\">OAP 169: Interview w/ Kevin Davitt &#8211; Former Market Maker &#038; CBOE Senior Instructor</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 168: The 27 Biggest Options Trading Fears": "<p>Did you know that fear has nothing to do with logical or cognitive reasoning? It&#8217;s actually a completely physical response that originates in our body. We fear to be wrong because that might mean we will be alone and people will leave us, which means that we won&#8217;t be part of a tribe or community, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/options-trading-fears-176896.html\">OAP 168: The 27 Biggest Options Trading Fears</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 167: Options Trading Profit Targets – When Should You Break The Rules?": "<p>Oh, profit targets. The double edge sword of confusion for many traders. Take profits too early and you feel like you left money on the table. Too late and you kick yourself because the trade could have moved against you. And because we&#8217;ve been getting so many questions on when and why we&#8217;ve let positions [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/options-trading-profit-targets-175881.html\">OAP 167: Options Trading Profit Targets &#8211; When Should You Break The Rules?</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 166: Understanding The Put Call Ratio The Right Way": "<p>When it comes to market signals and timing indicators, the Put Call Ratio is one that naturally jumps to the top of many lists. Because the indicator looks at volume in both put and call options, the logical conclusion is that we can interpret the ratio to signal us from an impending top or possible [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/understanding-put-call-option-175229.html\">OAP 166: Understanding The Put Call Ratio The Right Way</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 165: Trading Options? Here Are The 11 “Golden Rules” To Follow": "<p>Personally, I don&#8217;t like rules. Mostly because I value freedom and flexibility so when someone says that I have to follow the rules I naturally push back. Things that confine me or tell me what to do don&#8217;t fly well with me. But that only applies to things outside of trading and investing. In the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/trading-options-golden-rules-171557.html\">OAP 165: Trading Options? Here Are The 11 &#8220;Golden Rules&#8221; To Follow</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "TD Ameritrade Announces The End of Trading Commissions": "<p>Today October 1st, TD Ameritrade, makers of the thinkorswim platform, announced the end of trading commissions as we’ve always known them. Get ready to enter a new era of retail trading! As the preferred brokerage of Option Alpha, we wanted to give you a rundown of these changes, and give you some insight on what [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/td-ameritrade-announces-end-of-trading-commissions-171348.html\">TD Ameritrade Announces The End of Trading Commissions</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 164: The 2 Major Problems With Buying Options During Low IV Markets": "<p>Since we are option sellers and our edge comes from selling overpriced options out into maturity it&#8217;s natural to assume that if we want to sell options when IV is high that buying options during low IV markets is a way to make money in the other direction. We get it and understand the rationale [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/buying-options-during-low-iv-markets-171082.html\">OAP 164: The 2 Major Problems With Buying Options During Low IV Markets</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 163: The 5 Month “Grind” Following XLE Short Put Option Assignment": "<p>This was a long trade. Maybe not the longest trade we&#8217;ve been involved in, but certainly one of the top ones as this short put option assignment lasted over 5 months. For most options traders looking to make a quick buck, this trade stretches their patience and conviction far beyond a reasonable level. Still, I [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/short-put-option-assignment-2-170807.html\">OAP 163: The 5 Month &#8220;Grind&#8221; Following XLE Short Put Option Assignment</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "Cryptos: Bitcoin plunges 26%, its sharpest selloff in 7 years": "Cryptocurrencies were not immune to the coronavirus-related selloff on Wall Street on Thursday, as the price of bitcoin plummeted 26%, its worst daily selloff in seven years.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=qPHllZySNTI:D_QgWFZZNMo:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=qPHllZySNTI:D_QgWFZZNMo:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=qPHllZySNTI:D_QgWFZZNMo:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=qPHllZySNTI:D_QgWFZZNMo:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=qPHllZySNTI:D_QgWFZZNMo:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=qPHllZySNTI:D_QgWFZZNMo:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/qPHllZySNTI\" height=\"1\" width=\"1\" alt=\"\"/>", "These industries are more likely to have layoffs if the coronavirus pandemic worsens — but one sector looks ‘recession-proof’": "‘I am scheduled to be in more than a dozen different U.S. cities over the next six weeks,’ Chip Rogers, president and CEO of the American Hotel & Lodging Association, told MarketWatch.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=j9t2_sXbW4A:X0Y_WpnMoyw:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=j9t2_sXbW4A:X0Y_WpnMoyw:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=j9t2_sXbW4A:X0Y_WpnMoyw:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=j9t2_sXbW4A:X0Y_WpnMoyw:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=j9t2_sXbW4A:X0Y_WpnMoyw:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=j9t2_sXbW4A:X0Y_WpnMoyw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/j9t2_sXbW4A\" height=\"1\" width=\"1\" alt=\"\"/>", "How do I self-quarantine? Can I answer the door or walk my dog? There can be legal consequences if you violate it": "There’s a lot of confusion about preventing the spread of the novel coronavirus. Here’s what health experts recommend.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Z0AtM8GLePc:7p_v3zF-xe8:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Z0AtM8GLePc:7p_v3zF-xe8:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=Z0AtM8GLePc:7p_v3zF-xe8:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Z0AtM8GLePc:7p_v3zF-xe8:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=Z0AtM8GLePc:7p_v3zF-xe8:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Z0AtM8GLePc:7p_v3zF-xe8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/Z0AtM8GLePc\" height=\"1\" width=\"1\" alt=\"\"/>", "Market Extra: The Dow just tumbled into a bear market — here’s how long those downturns last on average": "It’s the end of a bullish era for the stock market and the beginning of a new phase of bearishness, after a sharp plunge for risk assets on Wednesday pushed the Dow Jones Industrial Average into bear-market territory for the first time in more than a decade.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=X6lkYxHSTVk:NjyLgVE9P3U:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=X6lkYxHSTVk:NjyLgVE9P3U:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=X6lkYxHSTVk:NjyLgVE9P3U:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=X6lkYxHSTVk:NjyLgVE9P3U:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=X6lkYxHSTVk:NjyLgVE9P3U:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=X6lkYxHSTVk:NjyLgVE9P3U:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/X6lkYxHSTVk\" height=\"1\" width=\"1\" alt=\"\"/>", "‘Freaking out doesn’t help.’ 10 things you can do right now — instead of losing your head about the Dow or coronavirus": "Worried about COVID-19 and the market turmoil? Take these actions to improve your emotional, physical and financial health.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=vWpygX_GAbg:QE_s2q4-47E:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=vWpygX_GAbg:QE_s2q4-47E:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=vWpygX_GAbg:QE_s2q4-47E:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=vWpygX_GAbg:QE_s2q4-47E:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=vWpygX_GAbg:QE_s2q4-47E:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=vWpygX_GAbg:QE_s2q4-47E:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/vWpygX_GAbg\" height=\"1\" width=\"1\" alt=\"\"/>", "The Moneyist: ‘It’s like a Gothic novel.’ My mom had an aortic-aneurysm rupture — my sister moved into her home and, when our mother died, never moved out. Is it too late for justice?": "‘After our mother’s memorial service, my sister called me and said, ‘I just want to tell you that there is no money.’’<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=zjZ6bj6qLhI:VF5on3zqdic:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=zjZ6bj6qLhI:VF5on3zqdic:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=zjZ6bj6qLhI:VF5on3zqdic:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=zjZ6bj6qLhI:VF5on3zqdic:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=zjZ6bj6qLhI:VF5on3zqdic:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=zjZ6bj6qLhI:VF5on3zqdic:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/zjZ6bj6qLhI\" height=\"1\" width=\"1\" alt=\"\"/>", "Influenza kills more people than coronavirus so everyone is overreacting, right? Wrong — and here’s why": "On Monday, President Trump compared coronavirus deaths to those of the flu. On Wednesday, he suspended all travel to the U.S. from Europe.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=9MLzePLjXB0:1BDo6oKz-n8:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=9MLzePLjXB0:1BDo6oKz-n8:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=9MLzePLjXB0:1BDo6oKz-n8:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=9MLzePLjXB0:1BDo6oKz-n8:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=9MLzePLjXB0:1BDo6oKz-n8:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=9MLzePLjXB0:1BDo6oKz-n8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/9MLzePLjXB0\" height=\"1\" width=\"1\" alt=\"\"/>", "Private-jet companies in Europe swamped with calls to fly CEOs, sports stars and entertainers to the U.S. after Trump’s travel-ban announcement": "‘One client is flying his daughter home to the U.S. from university in France, and several of her fellow students are sharing the flight back with her,’ said Adam Twidell, CEO of PrivateFly.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=i7i9lg3VhKw:-Cl6_xHfk6c:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=i7i9lg3VhKw:-Cl6_xHfk6c:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=i7i9lg3VhKw:-Cl6_xHfk6c:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=i7i9lg3VhKw:-Cl6_xHfk6c:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=i7i9lg3VhKw:-Cl6_xHfk6c:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=i7i9lg3VhKw:-Cl6_xHfk6c:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/i7i9lg3VhKw\" height=\"1\" width=\"1\" alt=\"\"/>", "Slack earnings: Shares plunge 22% on widening loss": "Slack Technologies Inc. shares slumped 16% in after-hours trading Thursday after the digital-collaboration platform reported fourth-quarter earnings that fell short of Wall Street revenue estimates and a widening loss.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=pwFKiEYLenM:cdBRbdosGpI:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=pwFKiEYLenM:cdBRbdosGpI:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=pwFKiEYLenM:cdBRbdosGpI:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=pwFKiEYLenM:cdBRbdosGpI:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=pwFKiEYLenM:cdBRbdosGpI:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=pwFKiEYLenM:cdBRbdosGpI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/pwFKiEYLenM\" height=\"1\" width=\"1\" alt=\"\"/>", "The Ratings Game: Here is a shopping list for chip stocks as coronavirus craters the market": "Chip stock gains have outpaced the broader market for well more than a year, but now that they’re plummeting along with everything else amid fears about COVID-19, a Morgan Stanley analyst released a potential shopping list for the sector Thursday.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=NIAMfG8hQUY:ikFWAqv28aM:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=NIAMfG8hQUY:ikFWAqv28aM:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=NIAMfG8hQUY:ikFWAqv28aM:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=NIAMfG8hQUY:ikFWAqv28aM:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=NIAMfG8hQUY:ikFWAqv28aM:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=NIAMfG8hQUY:ikFWAqv28aM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/NIAMfG8hQUY\" height=\"1\" width=\"1\" alt=\"\"/>"}