{"The new tools of monetary policy": "Since the 1980s, interest rates around the world have trended downward, reflecting lower inflation, demographic and technological forces that have increased desired global saving relative to desired investment, and other factors. Although low inflation and interest rates have many benefits, the new environment poses challenges for central banks, who have traditionally relied on cuts to&hellip;", "Evaluating lower-for-longer policies: Temporary price-level targeting": "Despite a long and sustained recovery from the Great Recession, a number of factors—including an aging population, slow productivity growth, and subdued inflation—continue to exert downward pressure on U.S. interest rates. It seems likely that even when monetary policy is at a neutral setting, neither restraining nor stimulating the economy, interest rates will remain significantly&hellip;", "The housing bubble, the credit crunch, and the Great Recession: A reply to Paul Krugman": "Why was the Great Recession so deep? Certainly, the collapse of the housing bubble was the key precipitating event; falling house prices depressed consumer wealth and spending while leading to sharp reductions in residential construction. However, as I argue in a new paper and blog post, the most damaging aspect of the unwinding bubble was&hellip;", "Financial panic and credit disruptions in the 2007-09 crisis": "At the height of the financial crisis a decade ago, economists and policymakers underestimated the depth and severity of the recession that would follow. I argue in a paper released today by the Brookings Papers on Economic Activity (BPEA) that remedying this failure demands a more thorough inclusion of credit-market factors in models and forecasts&hellip;", "Temporary price-level targeting: An alternative framework for monetary policy": "Low nominal interest rates, low inflation, and slow economic growth pose challenges to central bankers. In particular, with estimates of the long-run equilibrium level of the real interest rate quite low, the next recession may occur at a time when the Fed has little room to cut short-term rates. As I have written previously and&hellip;", "When growth is not enough": "Here is the text of my prepared remarks (“When Growth Is Not Enough”) for the European Central Bank Forum on Central Banking at Sintra on “Investment and growth in advanced economies.” Read my full remarks here.", "Some reflections on Japanese monetary policy": "Over the years, I’ve done a lot thinking and writing about challenges faced by Japanese monetary policymakers in their attempts to combat deflation. In some of my earlier pieces I argued that, if the Bank of Japan (BOJ) showed more resolve, it could readily overcome these problems. But, in recent years, the Bank has shown&hellip;", "The zero lower bound on interest rates:  How should the Fed respond?": "In yesterday’s post, I discussed recent research, by Michael Kiley and John Roberts of the Federal Reserve Board, on the problems for monetary policy that arise from the fact that short-term interest rates can’t fall (much) below zero. [1] Using econometric models to simulate the performance of the U.S. economy, Kiley and Roberts (KR) find that,&hellip;", "How big a problem is the zero lower bound on interest rates?": "If inflation is too low or unemployment too high, the Fed normally responds by pushing down short-term interest rates to boost spending. However, the scope for rate cuts is  limited by the fact that interest rates cannot fall (much) below zero, as people always have the option of holding cash, which pays zero interest, rather&hellip;", "Why Dodd-Frank’s orderly liquidation authority should be preserved": "The collapse of the investment bank Lehman Brothers in September 2008 was perhaps the defining event of the financial crisis. Lehman’s bankruptcy, followed by the near-collapse (save for government intervention) of the insurance company AIG, greatly intensified the fear and panic in markets, bringing the financial system and the economy to the brink of the&hellip;", "Options Players Eye More Upside for General Mills Stock": "General Mills is enjoying today's broad-market rally", "Disney Stock Higher Despite Temporary Park Closings": "DIS puts are popular today", "Oracle Stock Brushes Off Bear Notes After Earnings": "Oracle reported fiscal third-quarter earnings that beat analysts expectations but revenue that missed the mark", "Comcast Moves Higher on Temporary Park Closure": "Comcast stock is moving higher after a long-term drop on the charts", "BBY Stock Slammed After Executive Chairman Steps Down": "Former company CEO Hubert Joly announced his resignation as Executive Chairman today", "All Eyes on Fed Meeting Next Week as Coronavirus Grips U.S.": "FedEx, General Mills, and Lennar all step into the earnings confessional", "Sentiment Turns Sour Ahead of ULTA Earnings": "Ulta Beauty will post its fourth-quarter earnings after the close tonight", "Apple Supplier Ready to Step into Earnings Confessional": "Broadcom is expected to reveal its fourth-quarter report after the close tonight", "CME Closes Floor on Safety Concerns but loses Ground": "CME Group closed its Chicago trading floor due to concerns over the spread of the coronavirus", "Boeing Stock Tanks on Billion-Dollar Loan Buzz": "Boeing stock is plummeting on its first downgrade from JPM in years", "Party City Stock Deflates After Earnings": "The retailer's fourth-quarter earnings and revenue reports fell well below analysts' expectation", "Technical Signal Could Wilt Sprouts Farmers Market Stock": "The 80-day moving average has meant more downside for SFM in the past", "Utility Stock Overdue for Bear Notes": "There's optimism to be unwound in the options pits, too", "Drug Stock Upgraded Despite Coronavirus Threat": "Goldman Sachs added Eli Lilly to its \"Conviction Buy\" list", "FCAU Stock Destroyed Amid Temporary Plant Closures": "The automaker announced that it was temporarily stopping production at its Italian factories", "PepsiCo Stock Sinks on Heels of $3.85 Billion Buyout": "PepsiCo Inc's stocks are down after the company bought Rockstar Energy Beverage", "FDA Clearance Sends Soliton Stock Surging": "SOLY continues to teeter along its year-to-date breakeven price", "How Stocks Behave During During a Market Bounce": "A look at which stocks do best after a V-bottom", "Buy the Dip on This Gold Stock": "Mining stocks have pushed higher amid the global sell-off", "Drug Stock Puts Trendline Support to the Test": "GILD has amassed 19% year-to-date", "Struggling Southwest Airline Stock Sinks Deeper on CEO Pay Cut": "Southwest Airlines' CEO announced he's taking a 10% pay cut in response to the sector's \"severe recession\"", "Earnings Beat Boosts Dick's Sporting Goods Stock": "The retailer just posted a fourth-quarter earnings and revenue beat", "Japanese Pharma Stock Sinks Amid COVID-19 Treatment": "AIM Immunotech is developing a vaccine that was used to contain the SARS outbreak", "SFIX Stock Falls With Revenue Forecast, Coronavirus": "Several analysts have cut their price targets", "GrubHub Stock Brushes Off Bull Note": "Grubhub was raised to \"perform\" from \"underperform\"", "Option Alpha’s New Auto-Trading Platform Updates": "<p>Important Note: This post will be the central hub for updates on the new platform. It&#8217;ll be updated as needed and as new milestones are hit and/or when feedback is requested. The newest updates will be added to the top of the post with older updates pushed lower for reference. We encourage you to bookmark [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/option-alphas-new-auto-trading-platform-updates-162692.html\">Option Alpha&#8217;s New Auto-Trading Platform Updates</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 170: The 5 Critical Factors for ANY Trading Strategy": "<p>Factor-based strategies and trading systems are all the rage these days. We&#8217;ve been promoting these for many years now but it seems that more and more investors are catching on. As a result, we wanted to cover the 5 critical factors that your trading strategy should have. To us, these serve as the foundational elements [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/factor-trading-strategy-181568.html\">OAP 170: The 5 Critical Factors for ANY Trading Strategy</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 169: Interview w/ Kevin Davitt – Former Market Maker & CBOE Senior Instructor": "<p>This week we&#8217;re very excited to share our exclusive interview with Kevin Davitt, a special guest with tons of experience not only as a former market maker, but as the Senior Instructor for The Options Institute at CBOE. As many long-time listener&#8217;s know, we are highly selective with people we choose to bring on as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/kevin-davitt-market-maker-cboe-179348.html\">OAP 169: Interview w/ Kevin Davitt &#8211; Former Market Maker &#038; CBOE Senior Instructor</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 168: The 27 Biggest Options Trading Fears": "<p>Did you know that fear has nothing to do with logical or cognitive reasoning? It&#8217;s actually a completely physical response that originates in our body. We fear to be wrong because that might mean we will be alone and people will leave us, which means that we won&#8217;t be part of a tribe or community, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/options-trading-fears-176896.html\">OAP 168: The 27 Biggest Options Trading Fears</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 167: Options Trading Profit Targets – When Should You Break The Rules?": "<p>Oh, profit targets. The double edge sword of confusion for many traders. Take profits too early and you feel like you left money on the table. Too late and you kick yourself because the trade could have moved against you. And because we&#8217;ve been getting so many questions on when and why we&#8217;ve let positions [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/options-trading-profit-targets-175881.html\">OAP 167: Options Trading Profit Targets &#8211; When Should You Break The Rules?</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 166: Understanding The Put Call Ratio The Right Way": "<p>When it comes to market signals and timing indicators, the Put Call Ratio is one that naturally jumps to the top of many lists. Because the indicator looks at volume in both put and call options, the logical conclusion is that we can interpret the ratio to signal us from an impending top or possible [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/understanding-put-call-option-175229.html\">OAP 166: Understanding The Put Call Ratio The Right Way</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 165: Trading Options? Here Are The 11 “Golden Rules” To Follow": "<p>Personally, I don&#8217;t like rules. Mostly because I value freedom and flexibility so when someone says that I have to follow the rules I naturally push back. Things that confine me or tell me what to do don&#8217;t fly well with me. But that only applies to things outside of trading and investing. In the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/trading-options-golden-rules-171557.html\">OAP 165: Trading Options? Here Are The 11 &#8220;Golden Rules&#8221; To Follow</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "TD Ameritrade Announces The End of Trading Commissions": "<p>Today October 1st, TD Ameritrade, makers of the thinkorswim platform, announced the end of trading commissions as we’ve always known them. Get ready to enter a new era of retail trading! As the preferred brokerage of Option Alpha, we wanted to give you a rundown of these changes, and give you some insight on what [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/td-ameritrade-announces-end-of-trading-commissions-171348.html\">TD Ameritrade Announces The End of Trading Commissions</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 164: The 2 Major Problems With Buying Options During Low IV Markets": "<p>Since we are option sellers and our edge comes from selling overpriced options out into maturity it&#8217;s natural to assume that if we want to sell options when IV is high that buying options during low IV markets is a way to make money in the other direction. We get it and understand the rationale [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/buying-options-during-low-iv-markets-171082.html\">OAP 164: The 2 Major Problems With Buying Options During Low IV Markets</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "OAP 163: The 5 Month “Grind” Following XLE Short Put Option Assignment": "<p>This was a long trade. Maybe not the longest trade we&#8217;ve been involved in, but certainly one of the top ones as this short put option assignment lasted over 5 months. For most options traders looking to make a quick buck, this trade stretches their patience and conviction far beyond a reasonable level. Still, I [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://optionalpha.com/short-put-option-assignment-2-170807.html\">OAP 163: The 5 Month &#8220;Grind&#8221; Following XLE Short Put Option Assignment</a> appeared first on <a rel=\"nofollow\" href=\"https://optionalpha.com\">Option Alpha</a>.</p>", "Hackers are using coronavirus concerns to trick you, cybersecurity pros warn": "The COVID-19 coronavirus isn’t the only virus people have to worry about as the fear of the pandemic has become a powerful tool for hackers to get you to click on one of their links without thinking.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=zGgs8L4wiJQ:NpevqxgkOqU:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=zGgs8L4wiJQ:NpevqxgkOqU:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=zGgs8L4wiJQ:NpevqxgkOqU:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=zGgs8L4wiJQ:NpevqxgkOqU:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=zGgs8L4wiJQ:NpevqxgkOqU:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=zGgs8L4wiJQ:NpevqxgkOqU:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/zGgs8L4wiJQ\" height=\"1\" width=\"1\" alt=\"\"/>", "MLB ceases operations, NBA and NHL seasons suspended, no March Madness: Sporting events are being canceled or will be held in empty arenas amid coronavirus concerns": "Major sports leagues are bracing for what could be a very different world.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=3xFY2z5OWAM:RIv08EDOkkk:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=3xFY2z5OWAM:RIv08EDOkkk:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=3xFY2z5OWAM:RIv08EDOkkk:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=3xFY2z5OWAM:RIv08EDOkkk:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=3xFY2z5OWAM:RIv08EDOkkk:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=3xFY2z5OWAM:RIv08EDOkkk:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/3xFY2z5OWAM\" height=\"1\" width=\"1\" alt=\"\"/>", "Europe Markets: European equities log worst week since 2008 as coronavirus worries ramp up": "European stocks rose Friday, rebounding from an historic losing day Thursday, as more government support appeared for hard-hit economies in the region, while several exchanges banned short selling of hard-hit Spanish and Italian equities.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=00m9SY02GrU:A5a5tDGLi7w:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=00m9SY02GrU:A5a5tDGLi7w:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=00m9SY02GrU:A5a5tDGLi7w:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=00m9SY02GrU:A5a5tDGLi7w:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=00m9SY02GrU:A5a5tDGLi7w:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=00m9SY02GrU:A5a5tDGLi7w:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/00m9SY02GrU\" height=\"1\" width=\"1\" alt=\"\"/>", "Key Words: Jerry Falwell Jr. slammed for suggesting North Korea created the coronavirus to hurt America": "He also said people are ‘overreacting’ to COVID-19 on ‘Fox & Friends’ on Friday.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=DPiCSGFeG_E:XIHOHw-iNRA:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=DPiCSGFeG_E:XIHOHw-iNRA:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=DPiCSGFeG_E:XIHOHw-iNRA:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=DPiCSGFeG_E:XIHOHw-iNRA:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=DPiCSGFeG_E:XIHOHw-iNRA:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=DPiCSGFeG_E:XIHOHw-iNRA:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/DPiCSGFeG_E\" height=\"1\" width=\"1\" alt=\"\"/>", "Outside the Box: Think kids won’t suffer from COVID-19? Wrong: It threatens them with more poverty, hunger, homelessness": "Over half of our nation’s children are at serious risk from the economic impacts of the coronavirus on their families.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=J9rfcGq19a4:E7ATX7nC1m4:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=J9rfcGq19a4:E7ATX7nC1m4:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=J9rfcGq19a4:E7ATX7nC1m4:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=J9rfcGq19a4:E7ATX7nC1m4:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=J9rfcGq19a4:E7ATX7nC1m4:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=J9rfcGq19a4:E7ATX7nC1m4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/J9rfcGq19a4\" height=\"1\" width=\"1\" alt=\"\"/>", "Work-from-home tech stocks — the next big thing or shiny new object?": "Zoom Video, Slack, Dropbox and others are in the spotlight as companies across America send workers home.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=J_H3zKBVUVA:lq1Dv-OHLEE:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=J_H3zKBVUVA:lq1Dv-OHLEE:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=J_H3zKBVUVA:lq1Dv-OHLEE:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=J_H3zKBVUVA:lq1Dv-OHLEE:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=J_H3zKBVUVA:lq1Dv-OHLEE:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=J_H3zKBVUVA:lq1Dv-OHLEE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/J_H3zKBVUVA\" height=\"1\" width=\"1\" alt=\"\"/>", "Commodities Corner: Here’s how copper has weathered the COVID-19 economic storm": "Copper, known as a leading indicator of economic activity, has suffered along with many other commodities on the heels of the spread of the coronavirus. Futures prices were trading well below a January peak but faring better than other markets, like oil.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Lpw8veh0Wcg:l3hNtcVmG3Y:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Lpw8veh0Wcg:l3hNtcVmG3Y:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=Lpw8veh0Wcg:l3hNtcVmG3Y:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Lpw8veh0Wcg:l3hNtcVmG3Y:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=Lpw8veh0Wcg:l3hNtcVmG3Y:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=Lpw8veh0Wcg:l3hNtcVmG3Y:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/Lpw8veh0Wcg\" height=\"1\" width=\"1\" alt=\"\"/>", "London Markets: London stocks bounce, but set for biggest weekly loss since the financial crisis": "London stocks were headed for the worst weekly performance since the 2008 Great Financial Crisis, even as they clawed back a fraction of some lost territory on Friday.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=VxN_SPgvvO0:cTe9SC-YMtE:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=VxN_SPgvvO0:cTe9SC-YMtE:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=VxN_SPgvvO0:cTe9SC-YMtE:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=VxN_SPgvvO0:cTe9SC-YMtE:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=VxN_SPgvvO0:cTe9SC-YMtE:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=VxN_SPgvvO0:cTe9SC-YMtE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/VxN_SPgvvO0\" height=\"1\" width=\"1\" alt=\"\"/>", "Market Snapshot: Dow and S&P 500 cling to early gains Friday, after biggest one-day rout since 1987 crash": "U.S. stocks are paring Friday’s earlier gains, even as the Federal Reserve moved to expand efforts to shore up market liquidity, a day after the Dow and the S&P 500 suffered their biggest one-day plunge since the October 1987 crash.<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=TlHaxKOpVfQ:UIkTxR1T6Nk:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=TlHaxKOpVfQ:UIkTxR1T6Nk:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=TlHaxKOpVfQ:UIkTxR1T6Nk:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=TlHaxKOpVfQ:UIkTxR1T6Nk:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=TlHaxKOpVfQ:UIkTxR1T6Nk:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=TlHaxKOpVfQ:UIkTxR1T6Nk:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/TlHaxKOpVfQ\" height=\"1\" width=\"1\" alt=\"\"/>", "NewsWatch: As coronavirus spreads, CDC warns Americans about traveling inside the U.S.": "‘If COVID-19 is spreading at your destination, but not where you live, you may be at higher risk of exposure if you travel there.’<div class=\"feedflare\">\n<a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=G_DPkDo6Mpc:GXkxzhKC4U0:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=G_DPkDo6Mpc:GXkxzhKC4U0:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=G_DPkDo6Mpc:GXkxzhKC4U0:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=G_DPkDo6Mpc:GXkxzhKC4U0:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?i=G_DPkDo6Mpc:GXkxzhKC4U0:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.marketwatch.com/~ff/marketwatch/topstories?a=G_DPkDo6Mpc:GXkxzhKC4U0:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/marketwatch/topstories?d=qj6IDK7rITs\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/marketwatch/topstories/~4/G_DPkDo6Mpc\" height=\"1\" width=\"1\" alt=\"\"/>"}